
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'acpica'
brew 'aider'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aribb24'
brew 'asdf'
brew 'aspell'
brew 'assimp'
brew 'at-spi2-core'
brew 'atool'
brew 'atuin'
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'bat'
brew 'bc'
brew 'binwalk'
brew 'bob'
brew 'boost'
brew 'brew-php-switcher'
brew 'brotli'
brew 'btop'
brew 'bzip2'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'capstone'
brew 'ceres-solver'
brew 'certifi'
brew 'cffi'
brew 'cfitsio'
brew 'cgif'
brew 'cgns'
brew 'chafa'
brew 'cjson'
brew 'clamav'
brew 'cmake'
brew 'composer'
brew 'coreutils'
brew 'curl'
brew 'dark-mode'
brew 'dav1d'
brew 'dbus'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dnscrypt-proxy'
brew 'dockerfile-language-server'
brew 'double-conversion'
brew 'dra'
brew 'dtc'
brew 'dua-cli'
brew 'duf'
brew 'dust'
brew 'eigen'
brew 'emojify'
brew 'exiftool'
brew 'expat'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'fdupes'
brew 'fetch'
brew 'ffmpeg'
brew 'fftw'
brew 'fish'
brew 'fisher'
brew 'flac'
brew 'flawz'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdk-pixbuf'
brew 'gdu'
brew 'gettext'
brew 'gflags'
brew 'gfxutil'
brew 'gh'
brew 'ghostscript'
brew 'ghq'
brew 'giflib'
brew 'git'
brew 'git-cliff'
brew 'git-crypt'
brew 'git-delta'
brew 'git-flow'
brew 'git-lfs'
brew 'github-keygen'
brew 'gitmoji'
brew 'glew'
brew 'glib'
brew 'glog'
brew 'glow'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'go-task'
brew 'gpa'
brew 'gpg-tui'
brew 'gpgme'
brew 'graphite2'
brew 'grc'
brew 'grep'
brew 'grex'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'harfbuzz'
brew 'hdf5'
brew 'helm'
brew 'hicolor-icon-theme'
brew 'highlight'
brew 'highway'
brew 'htop'
brew 'hub'
brew 'hunspell'
brew 'hwloc'
brew 'hyperfine'
brew 'icu4c@77'
brew 'imagemagick'
brew 'imath'
brew 'isl'
brew 'jansson'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'json-c'
brew 'jsoncpp'
brew 'keychain'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lame'
brew 'lazydocker'
brew 'lazygit'
brew 'ldns'
brew 'leptonica'
brew 'libaec'
brew 'libapplewm'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcbor'
brew 'libclc'
brew 'libde265'
brew 'libdeflate'
brew 'libdicom'
brew 'libepoxy'
brew 'libevent'
brew 'libexif'
brew 'libfido2'
brew 'libfontenc'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libharu'
brew 'libheif'
brew 'libice'
brew 'libidn'
brew 'libidn2'
brew 'libimagequant'
brew 'libksba'
brew 'liblqr'
brew 'libmagic'
brew 'libmatio'
brew 'libmaxminddb'
brew 'libmicrohttpd'
brew 'libmng'
brew 'libmpc'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libogg'
brew 'libomp'
brew 'libpaper'
brew 'libpng'
brew 'libpq'
brew 'libraqm'
brew 'libraw'
brew 'librist'
brew 'librsvg'
brew 'libsamplerate'
brew 'libscrypt'
brew 'libsixel'
brew 'libslirp'
brew 'libsm'
brew 'libsmi'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libspng'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxfixes'
brew 'libxfont2'
brew 'libxi'
brew 'libxkbcommon'
brew 'libxkbfile'
brew 'libxml2'
brew 'libxmu'
brew 'libxrender'
brew 'libxt'
brew 'libxtst'
brew 'libyaml'
brew 'libzip'
brew 'lima'
brew 'little-cms2'
brew 'llvm'
brew 'localai'
brew 'lolcat'
brew 'lsd'
brew 'lua'
brew 'luarocks'
brew 'lynis'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'markdown'
brew 'mas'
brew 'mbedtls'
brew 'md4c'
brew 'memcached'
brew 'mesa'
brew 'meson'
brew 'metis'
brew 'mhash'
brew 'minikube'
brew 'mkcert'
brew 'molten-vk'
brew 'mozjpeg'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'mysql'
brew 'ncdu'
brew 'ncurses'
brew 'net-snmp'
brew 'netcdf'
brew 'nettle'
brew 'ninja'
brew 'nlohmann-json'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'numpy'
brew 'oniguruma'
brew 'onnx'
brew 'open-mpi'
brew 'openblas'
brew 'opencore-amr'
brew 'opencv'
brew 'openexr'
brew 'openjpeg'
brew 'openldap'
brew 'openslide'
brew 'openssh'
brew 'openssl@3'
brew 'openvino'
brew 'opus'
brew 'osx-cpu-temp'
brew 'ouch'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pass'
brew 'pcre'
brew 'pcre2'
brew 'php@8.2'
brew 'pillow'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pixman'
brew 'pkgconf'
brew 'pmix'
brew 'poppler'
brew 'popt'
brew 'privoxy'
brew 'proj'
brew 'protobuf'
brew 'protobuf-c'
brew 'protobuf@29'
brew 'psutils'
brew 'pugixml'
brew 'pycparser'
brew 'pyenv'
brew 'pygments'
brew 'pyqt'
brew 'python-packaging'
brew 'python-tk@3.13'
brew 'python@3.12'
brew 'python@3.13'
brew 'qemu'
brew 'qrencode'
brew 'qt'
brew 'rav1e'
brew 'rclone'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rich-cli'
brew 'ripgrep'
brew 'ripgrep-all'
brew 'rkhunter'
brew 'rsync'
brew 'rtmpdump'
brew 'rubberband'
brew 'scdoc'
brew 'scipy'
brew 'sdl2'
brew 'sevenzip'
brew 'shared-mime-info'
brew 'shfmt'
brew 'smimesign'
brew 'snappy'
brew 'speedtest-cli'
brew 'speex'
brew 'speexdsp'
brew 'spirv-llvm-translator'
brew 'spirv-tools'
brew 'sqlite'
brew 'squashfs'
brew 'srt'
brew 'sshpass'
brew 'starship'
brew 'suite-sparse'
brew 'svt-av1'
brew 'task'
brew 'taskwarrior-tui'
brew 'tbb'
brew 'tcl-tk'
brew 'tesseract'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'theora'
brew 'tidy-html5'
brew 'tig'
brew 'timewarrior'
brew 'tmux'
brew 'tor'
brew 'trash'
brew 'tre'
brew 'tre-command'
brew 'tree'
brew 'ubi'
brew 'unbound'
brew 'unixodbc'
brew 'unzip'
brew 'utf8cpp'
brew 'utf8proc'
brew 'uthash'
brew 'v2ray'
brew 'vde'
brew 'vips'
brew 'viu'
brew 'vsce'
brew 'vtk'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'wireguard-go'
brew 'wireguard-tools'
brew 'wireshark'
brew 'wp-cli'
brew 'x264'
brew 'x265'
brew 'xauth'
brew 'xcb-util'
brew 'xcb-util-image'
brew 'xcb-util-keysyms'
brew 'xcb-util-renderutil'
brew 'xcb-util-wm'
brew 'xclip'
brew 'xkbcomp'
brew 'xkeyboardconfig'
brew 'xorg-server'
brew 'xorgproto'
brew 'xsimd'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'yank'
brew 'yara'
brew 'yazi'
brew 'yq'
brew 'yt-dlp'
brew 'z'
brew 'z3'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zoxide'
brew 'zstd'

tap 'homebrew/cask'
cask 'alacritty'
cask 'alfred'
cask 'bettertouchtool'
cask 'blender-benchmark'
cask 'carbon-copy-cloner'
cask 'cinebench'
cask 'darktable'
cask 'dbngin'
cask 'eloston-chromium'
cask 'fbreader'
cask 'font-0xproto-nerd-font'
cask 'font-3270-nerd-font'
cask 'font-agave-nerd-font'
cask 'font-anonymice-nerd-font'
cask 'font-arimo-nerd-font'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-bigblue-terminal-nerd-font'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-caskaydia-mono-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-comic-shanns-mono-nerd-font'
cask 'font-commit-mono-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-d2coding-nerd-font'
cask 'font-daddy-time-mono-nerd-font'
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-departure-mono-nerd-font'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-envy-code-r-nerd-font'
cask 'font-fantasque-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-geist-mono-nerd-font'
cask 'font-go-mono-nerd-font'
cask 'font-gohufont-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-heavy-data-nerd-font'
cask 'font-hurmit-nerd-font'
cask 'font-im-writing-nerd-font'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-intone-mono-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-iosevka-term-nerd-font'
cask 'font-iosevka-term-slab-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lekton-nerd-font'
cask 'font-liberation-nerd-font'
cask 'font-lilex-nerd-font'
cask 'font-m+-nerd-font'
cask 'font-martian-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-monaspace-nerd-font'
cask 'font-monocraft-nerd-font'
cask 'font-monofur-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-open-dyslexic-nerd-font'
cask 'font-overpass-nerd-font'
cask 'font-profont-nerd-font'
cask 'font-proggy-clean-tt-nerd-font'
cask 'font-recursive-mono-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-shure-tech-mono-nerd-font'
cask 'font-space-mono-nerd-font'
cask 'font-symbols-only-nerd-font'
cask 'font-terminess-ttf-nerd-font'
cask 'font-tinos-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-ubuntu-sans-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'font-zed-mono-nerd-font'
cask 'gas-mask'
cask 'geekbench'
cask 'gitkraken'
cask 'gpg-suite'
cask 'hackintool'
cask 'hammerspoon'
cask 'hyper'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kext-updater'
cask 'kitty'
cask 'ledger-live'
cask 'local'
cask 'lulu'
cask 'macfuse'
cask 'monitorcontrol'
cask 'plistedit-pro'
cask 'sourcetree'
cask 'telegram'
cask 'textmate'
cask 'tower'
cask 'typora'
cask 'visual-studio-code'
cask 'vscodium'
cask 'xquartz'

tap 'buo/cask-upgrade'

tap 'cavaliercoder/dmidecode'

tap 'ddev/ddev'
brew 'ddev'

tap 'dnote/dnote'
brew 'dnote'

tap 'koekeishiya/formulae'
brew 'skhd'

tap 'nicoverbruggen/cask'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'shivammathur/php'

tap 'yakitrak/yakitrak'
brew 'obsidian-cli'

# App Store applications
mas 'Blackmagic Disk Speed Test (3.4.2)', id: 425264550
mas 'DocxEditor (3.0.2)', id: 588286789
mas 'Fair VPN (1.3.2)', id: 1533873488
mas 'Markdown Editor (1.5.0)', id: 1458220908
mas 'V2Box (9.5.1)', id: 6446814690
